# Aggregating DataFrames 
* count  계수를 사용하여 범주 형 데이터를 요약 
* Grouped summary statistics

In [1]:
import numpy as np
import pandas as pd

In [3]:
bike = pd.read_csv("Desktop/bike.csv")
bike.head(3)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32

#### drop_duplicates- 중복값 처리(unique한 1개의 key만 남기고 나머지 중복은 제거)

In [16]:
bike.drop_duplicates().sort_values(by = "temp" ,ascending = False).head(5) # 모든 열을 기준으로 중복값 제거

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
8311,2012-07-07 16:00:00,3,0,0,1,41.00,43.180,19,11.0014,102,192,294
8309,2012-07-07 14:00:00,3,0,0,2,39.36,43.180,30,8.9981,105,203,308
8307,2012-07-07 12:00:00,3,0,0,1,39.36,43.180,31,23.9994,124,218,342
8308,2012-07-07 13:00:00,3,0,0,2,39.36,43.180,31,16.9979,116,244,360
8312,2012-07-07 17:00:00,3,0,0,1,39.36,42.425,26,8.9981,103,176,279

#### drop_duplicates(subset = " " )  
* 열을 전달하면 중복된 열에 대해서만 고려됩니다. 열 또는 열 레이블 리스트를 사용하며 기본값은 none입니다.

In [32]:
bike.drop_duplicates(subset = "temp").sort_values(by = "temp" ,ascending = False).head(5) 
#subset 지정없이 "열이름" 사용 가능

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
8311,2012-07-07 16:00:00,3,0,0,1,41.00,43.180,19,11.0014,102,192,294
8307,2012-07-07 12:00:00,3,0,0,1,39.36,43.180,31,23.9994,124,218,342
2441,2011-06-09 15:00:00,2,0,1,1,38.54,41.665,31,11.0014,18,86,104
2416,2011-06-08 14:00:00,2,0,1,1,37.72,43.940,40,16.9979,44,111,155
2247,2011-06-01 13:00:00,2,0,1,1,36.90,40.910,37,12.9980,29,125,154

#### value_counts - Unique values 로 count 해주는 함수 
* sort - 정렬인수로 수 반환
* normalize - 정규화 인수를 사용하여 개수를 합계의 비율로 반환

In [38]:
bike["registered"].value_counts(sort =True) # Sort(True)는 디폴트

3      195
4      190
5      177
6      155
2      150
      ...
636      1
620      1
678      1
694      1
839      1
Name: registered, Length: 731, dtype: int64

In [39]:
bike["registered"].value_counts(normalize = True)

3      0.017913
4      0.017454
5      0.016259
6      0.014238
2      0.013779
         ...
636    0.000092
620    0.000092
678    0.000092
694    0.000092
839    0.000092
Name: registered, Length: 731, dtype: float64

#### Grouped summary statistics

#### groupby() - 데이터를 그룹별로 구분하여 비교하기 위한 함수

In [30]:
bike_registered_4 = bike[bike["season"]== 4]["registered"].sum()
bike_registered_3 = bike[bike["season"]== 3]["registered"].sum()
bike_registered_2 = bike[bike["season"]== 2]["registered"].sum()
bike_registered_1 = bike[bike["season"]== 1]["registered"].sum()

display(bike_registered_1 ,bike_registered_2 ,bike_registered_3 , bike_registered_4)

270893

458610

497944

465894

In [31]:
bike_registered_group = bike.groupby("season")["registered"].sum()
bike_registered_group

season
1    270893
2    458610
3    497944
4    465894
Name: registered, dtype: int64

groupby 함수를 사용할 시 복작한 코드 구성없이 그룹별 값을 추출할 수 있습니다.